<a href="https://colab.research.google.com/github/tejasrajanna/PredictThis_Olympics/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import plotly.express as px

Converting all the xlsx to csv and storing the files

In [2]:
read_file = pd.read_excel('/content/Athletes.xlsx')
read_file.to_csv (r'/content/Athletes.csv', index = None, header=True)
read_file = pd.read_excel('/content/Coaches.xlsx')
read_file.to_csv (r'/content/Coaches.csv', index = None, header=True)
read_file = pd.read_excel('/content/EntriesGender.xlsx')
read_file.to_csv (r'/content/EntriesGender.csv', index = None, header=True)
read_file = pd.read_excel('/content/Medals.xlsx')
read_file.to_csv (r'/content/Medals.csv', index = None, header=True)
read_file = pd.read_excel('/content/Teams.xlsx')
read_file.to_csv (r'/content/Teams.csv', index = None, header=True)
read_file = pd.read_excel('/content/Population data Assignment 1 Predict This.xlsx')
read_file.to_csv (r'/content/Population data Assignment 1 Predict This.csv', index = None, header=True)
df_athletes=pd.read_csv('/content/Athletes.csv')
df_coaches=pd.read_csv('/content/Coaches.csv')
df_gender=pd.read_csv('/content/EntriesGender.csv')
df_medals=pd.read_csv('/content/Medals.csv')
df_teams=pd.read_csv('/content/Teams.csv')
df_custom=pd.read_csv('/content/Population data Assignment 1 Predict This.csv')

Rough idea of all datasets

In [3]:
df_athletes.head()

                Name     NOC           Discipline
0    AALERUD Katrine  Norway         Cycling Road
1        ABAD Nestor   Spain  Artistic Gymnastics
2  ABAGNALE Giovanni   Italy               Rowing
3     ABALDE Alberto   Spain           Basketball
4      ABALDE Tamara   Spain           Basketball

In [4]:
df_coaches.head()

              Name            NOC  Discipline Event
0  ABDELMAGID Wael          Egypt    Football   NaN
1        ABE Junya          Japan  Volleyball   NaN
2    ABE Katsuhiko          Japan  Basketball   NaN
3     ADAMA Cherif  Côte d'Ivoire    Football   NaN
4       AGEBA Yuya          Japan  Volleyball   NaN

In [5]:
df_gender.head()

            Discipline  Female  Male  Total
0       3x3 Basketball      32    32     64
1              Archery      64    64    128
2  Artistic Gymnastics      98    98    196
3    Artistic Swimming     105     0    105
4            Athletics     969  1072   2041

In [6]:
df_medals.head()

   Rank                    Team/NOC  Gold  Silver  Bronze  Total  Rank by Total
0     1    United States of America    39      41      33    113              1
1     2  People's Republic of China    38      32      18     88              2
2     3                       Japan    27      14      17     58              5
3     4               Great Britain    22      21      22     65              4
4     5                         ROC    20      28      23     71              3

In [7]:
df_teams.head()

      Name      Discipline                         NOC  Event
0  Belgium  3x3 Basketball                     Belgium    Men
1    China  3x3 Basketball  People's Republic of China    Men
2    China  3x3 Basketball  People's Republic of China  Women
3   France  3x3 Basketball                      France  Women
4    Italy  3x3 Basketball                       Italy  Women

In [8]:
df_custom.head()

         Country  Population  Independence year  Annual Sports Budget
0            USA   328200000               1776                   NaN
1          China  1390000000               1949                   NaN
2          Japan   126300000                660                   NaN
3  Great Britain    66600000               1776                   NaN
4   Russia (ROC)   144400000               1990                   NaN

Rectifying country names in custom dataset

In [36]:
def func(x):
  if x=='USA':
    return 'United States of America'
  elif x=='China':
    return "People's Republic of China"
  elif x=='Russia (ROC)':
    return 'ROC'
  else:
    return x

df_custom["Country"]=df_custom['Country'].apply(func)
df_custom.head()

                      Country  Population  Independence year
0    United States of America   328200000               1776
1  People's Republic of China  1390000000               1949
2                       Japan   126300000                660
3               Great Britain    66600000               1776
4                         ROC   144400000               1990

Checking for NANs in each dataframe

In [22]:
print(df_athletes.isna().sum().sum())
print(df_coaches.isna().sum().sum())
print(df_gender.isna().sum().sum())
print(df_medals.isna().sum().sum())
print(df_teams.isna().sum().sum())
print(df_custom.isna().sum().sum())

0
145
0
0
0
15

Only the Coaches and Custom (provided by PredictThis) dataset has NANs

In [24]:
print(df_coaches.shape)
df_coaches.info()
df_coaches.drop('Event',axis=1, inplace=True)
#As this dataset is never used for this particular assignment, dropping a column is acceptable

(394, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 394 entries, 0 to 393
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        394 non-null    object
 1   NOC         394 non-null    object
 2   Discipline  394 non-null    object
 3   Event       249 non-null    object
dtypes: object(4)
memory usage: 12.4+ KB

In [26]:
print(df_custom.shape)
df_custom.info()
df_custom.drop('Annual Sports Budget',axis=1, inplace=True)
#Entire column is null

(15, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Country               15 non-null     object
 1   Population            15 non-null     int64
 2   Independence year     15 non-null     int64
 3   Annual Sports Budget  0 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 608.0+ bytes

Removing countries with zero medals

In [11]:
df_medals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           93 non-null     int64
 1   Team/NOC       93 non-null     object
 2   Gold           93 non-null     int64
 3   Silver         93 non-null     int64
 4   Bronze         93 non-null     int64
 5   Total          93 non-null     int64
 6   Rank by Total  93 non-null     int64
dtypes: int64(6), object(1)
memory usage: 5.2+ KB

In [12]:
df_medals.describe()

            Rank       Gold     Silver     Bronze       Total  Rank by Total
count  93.000000  93.000000  93.000000  93.000000   93.000000      93.000000
mean   46.333333   3.655914   3.634409   4.322581   11.612903      43.494624
std    26.219116   7.022471   6.626339   6.210372   19.091332      24.171769
min     1.000000   0.000000   0.000000   0.000000    1.000000       1.000000
25%    24.000000   0.000000   0.000000   1.000000    2.000000      23.000000
50%    46.000000   1.000000   1.000000   2.000000    4.000000      47.000000
75%    70.000000   3.000000   4.000000   5.000000   11.000000      66.000000
max    86.000000  39.000000  41.000000  33.000000  113.000000      77.000000

Minimum value of total is 1 so no countries with zero medals present in the dataset

Correlation between number of athletes from each country and medals

In [30]:
print(df_athletes['NOC'].nunique())
pop=df_athletes['NOC'].value_counts()
pop_countries=pop.index.to_series()
print(pop)

206
United States of America         615
Japan                            586
Australia                        470
People's Republic of China       401
Germany                          400
                                ...
St Vincent and the Grenadines      2
Nauru                              2
Somalia                            2
Marshall Islands                   2
Lesotho                            2
Name: NOC, Length: 206, dtype: int64

In [29]:
data = {"Countries": pop_countries,
        "Athletes_Population": pop}
df_pop = pd.concat(data,
               axis = 1)
df_pop.reset_index(drop=True, inplace= True)
print(df_pop)

                         Countries  Athletes_Population
0         United States of America                  615
1                            Japan                  586
2                        Australia                  470
3       People's Republic of China                  401
4                          Germany                  400
..                             ...                  ...
201  St Vincent and the Grenadines                    2
202                          Nauru                    2
203                        Somalia                    2
204               Marshall Islands                    2
205                        Lesotho                    2

[206 rows x 2 columns]

In [20]:
df_medals["Athletes_population"] = df_medals["Team/NOC"].map(lambda x: data['Athletes_Population'].get(x,x))
print(df_medals.head())

   Rank                    Team/NOC  ...  Athletes_Population  Athletes_population
0     1    United States of America  ...                  615                  615
1     2  People's Republic of China  ...                  401                  401
2     3                       Japan  ...                  586                  586
3     4               Great Britain  ...                  366                  366
4     5                         ROC  ...                  318                  318

[5 rows x 9 columns]

Graphs to show relation between medals and population

In [21]:

# Creating the Figure instance
fig = px.scatter(df_medals,x=df_medals["Gold"][:15], y=df_custom['Population']) 
  
# showing the plot
fig.show()

In [38]:
df_medals['population']= df_medals["Team/NOC"].map(df_custom.set_index('Country')['Population'])
df_medals[:20]

    Rank                    Team/NOC  ...  Athletes_population    population
0      1    United States of America  ...                  615  3.282000e+08
1      2  People's Republic of China  ...                  401  1.390000e+09
2      3                       Japan  ...                  586  1.263000e+08
3      4               Great Britain  ...                  366  6.660000e+07
4      5                         ROC  ...                  318  1.444000e+08
5      6                   Australia  ...                  470  2.540000e+07
6      7                 Netherlands  ...                  274  1.730000e+07
7      8                      France  ...                  377  6.710000e+07
8      9                     Germany  ...                  400  8.300000e+07
9     10                       Italy  ...                  356  6.040000e+07
10    11                      Canada  ...                  368  3.760000e+07
11    12                      Brazil  ...                  291  2.110000e+08
12    13                 New Zealand  ...                  202  4.920000e+06
13    14                        Cuba  ...                   69  1.130000e+07
14    15                     Hungary  ...                  155  9.770000e+06
15    16           Republic of Korea  ...                  223           NaN
16    17                      Poland  ...                  195           NaN
17    18              Czech Republic  ...                  117           NaN
18    19                       Kenya  ...                   78           NaN
19    20                      Norway  ...                   92           NaN

[20 rows x 10 columns]